public class Main {
    public static void main(String[] args) {

        // Школьники Вася и Петя играют в шпионов. Вася передает сообщение Пете.
        //    Для этого он разбивает последовательность букв на пятерки и
        //    переворачивает порядок букв в этих пятерках. Например:
        //  "Привет, мир" ->"(Приве)(т, ми)р" ->"евирпим, тр"


        //   Ваша задача, используя Stack восстановить последовательность букв
        //   (можно не составлять строку, достаточно буквы по одной выводить на экран


        Encoder encoder = new Encoder();
        encoder.encode("Привет, мир");
    }

}










